/* 
Legend
о = орех
\ = ветка. Орех, попавший в эту ветку, отскакивает вправо
/ = ветка. Орех, попавший в эту ветку, отскакивает влево
_ = ветка. Орех, попавший в эту ветку, застревает в дереве
. = листья, которые никак не влияют на падение орехов
| = ствол дерева, который не влияет на падение орехов
  = пустое пространство, которое не влияет на падение орехов

  Notes
Орехи всегда находятся на верхушке дерева
Орехи не влияют на характер падения других орехов
Между ветвями всегда достаточно места, чтобы орехи могли упасть
На крайних левых/ правых краях древовидной матрицы нет ветвей, поэтому орех не может выпасть "за пределы".

Example
.o.oooooo.o.o.oooooo.
..\.\.../..\.../..\..
..../..\..../....../.
.....\...././.\..\.\.
...../../././...\....
.../.../..\./.\..\...
./.......\../.\../...
....\..../....././...
.../.\._.\../._../.\.
.\...././....\../.\..
./......././.../../..
            

101005000020000000040
*/
const startTree = [
    `.o.oooooo.o.o.oooooo.`,
    `..\\.\\.../..\\.../..\\..`,
    `..../..\\..../....../.`,
    `.....\\...././.\\..\\.\\.`,
    `...../../././...\\....`,
    `.../.../..\\./.\\..\\...`,
    `./.......\\../.\\../...`,
    `....\\..../....././...`,
    `.../.\\._.\\../._../.\\.`,
    `.\\...././....\\../.\\..`,
    `./......././.../../..`,
];
var shakeTree = function (tree) {
    let res = [];

    tree[0]
        .split('')
        .forEach(item => (item === 'o' ? res.push(1) : res.push(0)));
    console.log('res', res);
    for (let item of tree) {
        let i = 0;
        let currentArray = item.split('');
        console.log(currentArray);
        while (i < currentArray.length) {
            if (currentArray[i] === '\\') {
                res[i + 1] += res[i];
                res[i] = 0;
            } else if (currentArray[i] === '/') {
                res[i - 1] += res[i];
                res[i] = 0;
            } else if (currentArray[i] === '_') {
                res[i] = 0;
            }

            ++i;
        }
        console.log('res', res);
    }
    // Your code here
    return res;
};

console.log(shakeTree(startTree));
